
export const persianWords: Set<string> = new Set([
  "ابر", "انار", "بار", "ربا", "ران", "بنا", "ناب", "انبر",
  "سیب", "بام", "آسیا", "سام", "بیم", "آبی", "مهر", "ماه", "سهم", "شبیه", "شیر",
  "کتاب", "کف", "بک", "شال", "قفل", "ادب", "دقت", "فدا", "لشک",
  "درس", "درست", "سرد", "تور", "ستون", "نور", "رود", "دست", "مهربان", "راه", "خانه",
  "سلام", "خداحافظ", "ماشین", "دوست", "بازار", "مدرسه", "دانشگاه",
  "ایران", "تهران", "شیراز", "اصفهان", "تبریز", "یزد", "کرمان", "رشت", "وطن",
  "روز", "شب", "دل",

  // Level 1
  "نبات", "تب", "تن", "بت", "بان", "تا", "آن", "نت", "نبأ", "تاب", "بنا",
  // Level 2
  "برنج", "رنج", "برج", "جن", "رج", "رب", "بر", "بن",
  // Level 3
  "تمشک", "مشک", "شکم", "تشک", "شک", "مت", "کشت", "شم",
  // Level 4
  "ترمز", "رمز", "رزم", "مرز", "رز", "رم", "مر", "تر", "تم",
  // Level 5
  "ریال", "ریل", "یار", "یل", "ری", "ایر", "لای", "آری",
  // Level 6
  "کلمه", "ملکه", "کلم", "ملک", "کل", "لک", "هم", "مه", "که",
  // Level 7
  "پاکت", "پاک", "پتک", "پک", "تک", "تاپ", "کات", "تپ",
  // Level 8
  "نقره", "هنر", "رهن", "قرن", "نهر", "ره", "نه", "رق", "نق", "قر", "هن",
  // Level 9
  "بالش", "بال", "بلا", "شال", "لب", "آش", "بل", "لاش",
  // Level 10
  "کاهو", "کاوه", "آهک", "کوه", "کاه", "آه", "کاو", "آوا", "وه", "هو", "ها",
  // Level 11
  "خمیر", "مریخ", "میخ", "خیر", "خم", "رخ", "ری", "خی", "مر",
]);
